# Curves Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Profile..::..Curves Property
Profile Class See Also
---
Retrieve the curves that make up the boundary of the profile.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CurveArray Curves { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Curves As CurveArray
	Get
```

Visual C++
---
```text
public:
property CurveArray^ Curves {
	CurveArray^ get ();
}
```

# See Also
Profile Class
Autodesk.Revit.DB Namespace